<template>
  <button
    @click="open"
    class="h-[32px] px-4 flex justify-between items-center gap-x-2 bg-[#ff7a2e] text-white rounded-[4px] font-medium text-sm"
  >
    Допомога
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="24"
      height="24"
      viewBox="0 0 24 24"
      fill="none"
      stroke="#fff"
      stroke-width="2"
      stroke-linecap="round"
      stroke-linejoin="round"
      class="w-4 h-4"
    >
      <circle cx="12" cy="12" r="10" />
      <path d="M9.09 9a3 3 0 0 1 5.83 1c0 2-3 3-3 3" />
      <path d="M12 17h.01" />
    </svg>
  </button>
  <VModal id="help-modal" title="Допомога" ref="modal">
    <div class="help-content">
      <p>Добро пожаловать в конструктор терминалов!</p>
      <p>
        Здесь вы сможете быстро и без навыков кода собрать интерфейс
        собственного терминала. В этом руководстве вы узнаете как пользоваться
        конструктором.
      </p>

      <p>Конструктор можно разделить на 3 основные состовляющее:</p>
      <ol>
        <li>Панель настроек</li>
        <li>Панель элементом</li>
        <li>Рабочая область</li>
      </ol>

      <img src="../../assets/instruction_image.png" alt="" />

      <p>Давайте рассмотрим каждый элемент подробнее.</p>

      <h1>Панель настроек</h1>

      <p>
        Область расположенная в левом крае экрана представляет собой набор
        кнопок, которые открываю опредленные настройки. Рассмотрим каждую
        кнопку:
      </p>

      <h2>Переход в Панель элементов</h2>

      <p>
        Открывает "Панель элементов" с помощью этой кнопки вы можете быстро
        перейти в панель элементов (см. Панель элементов)
      </p>

      <h2>Визуальные настройки</h2>

      <p>
        Открывает Визуальные настройки элемента, с помощью которых можно
        изменить: цвет текст, цвет фона, шрифт, размер шрифта, начертание
        шрифта, выравнивание шрифта, ширину, высоту, отступы внутри, отступы
        снаружи, минимальную/максимальную ширину и высоту. Для того, чтобы
        изменить Визуальные настройки элемента, нужно выбрать элемент в "Рабочей
        области" после чего нажать на кнопку на Панели настроек. Все изменения
        применяются автоматически
      </p>

      <h2>Настройки элемента</h2>

      <p>У каждого элемента есть свой набор настроек.</p>
      <ul>
        <li>Элемент <b>Форма</b> можно настроить Action, Method</li>
        <li>
          Элемент <b>Input</b> можно настроить Name, Placeholder, Type (text,
          password, email, number), Required (true / false)
        </li>
        <li>
          Элемент <b>Textarea</b> можно настроить Name, Placeholder, Required
          (true / false)
        </li>
      </ul>
      <p>
        Кроме того, существует настройка Translation Name, в которой нужно
        указать название ключа перевода (см. Локализация)
      </p>

      <h2>Слои</h2>

      <p>
        Панель, на которой иерархически отображены элементы, которые в текущий
        момент присутствуют в "Рабочей области". <b>Слои</b> позволяют более
        точечно управлять расположением элементов в "Рабочей области". Слои
        можно перетягивать, менять местами, вкладывать друг в друга.
      </p>
      <p>
        Например, если у вас есть слой Button и FormField вам нужно поменять их
        местами. Вы можете на панели слои перетащить Button выше чем FormField и
        автоматически этот порядок изменится в Рабочей области. Также вы можете
        скрывать/показывать элементы нажав на кнопку "Глазик". Вы можете удалить
        элемент выделив его и нажав кнопку Delete на клавиатуре
      </p>

      <h2>Экраны</h2>

      <p>
        На этой панели мы можете создавать / удалять / перемещаться между
        экранами. По-умолчанию у вас создан один экран. Каждый экран это
        отдельная html страница по итогу
      </p>
      <p>
        Изменения, которые вы проводите в Рабочей области сохраняются в рамках
        одного экрана, то если вы сделаете изменения для одного экрана,
        перейдете на другой - увидите чистую область. Но при этом, если
        вернетесь на предыдущий экран - изменения сохраняться. Таким образом
        можно параллельно работать над несколькими экранами
      </p>

      <h2>Настройки терминала</h2>

      <p>
        Здесь можно установить глобальные настройки для терминала, такие как
        Уровень громкости, Уровень яркости
      </p>

      <h2>Локализация</h2>

      <p>
        Локализация работает следующим образом. Перевод состоит из следующих
        элементов - ключ перевода, значение перевода. Ключ это своего рода
        название, псевдоним, обращаясь к которому можно получить значение.
      </p>

      <p>
        Например, у вас есть два языка - украинский, английский. Есть ключ
        перевода - "Текст кнопки". На английском значение будет "text for
        button", на украинском - "текст для кнопки". Система получит текущий
        язык, например, английский и найдет по ключу значение перевода и
        подставит в нужные элемент
      </p>

      <p>
        Как добавить перевод? Нужно нажать на кнопку
        <b>Добавить перевод</b> после чего вы увидите, что у вас появилось поле
        для ввода и перед ним текст (по-умолчанию начинается с new_) Этот текст
        и есть ключ. Вы можете его изменить: для этого нажмите на него два раза
        и введите значение.
      </p>

      <p>
        Хорошо, а как потом этот ключ привязать к элементу. Все просто. Вам
        нужно перетащить элемент, например, Кнопку. Далее выделив ее в Рабочей
        области нужно перейти в <b>Настройки элемента</b> и в поле Translation
        name ввести ключ перевода, который будет использоваться для получения
        значения
      </p>

      <p>Далее рассмотрим Панель элементов</p>

      <h1>Панель элементов</h1>

      <p>
        Содержит основные элементы, из которых будет строиться экран терминала
        Элементы разделены на 3 категории: Базовые, Анимации, Формы
      </p>

      <h2>Базовые</h2>

      <p>Все элементы, которые являются простыми единицами</p>

      <ul>
        <li>Кнопка - элемент кнопки</li>
        <li>
          Изображение - элемент картинки. При перетягивании на Рабочую область
          нужно загрузить картинку, которую нужно подставить
        </li>
        <li>
          Контейнер - это некая область, в которую можно вкладывать другие
          элементы. Как ящик, в который можно положить кнопки, картинки. Удобно
          использовать его для группирования элементов. Например, вы можете
          разместить Контейнер, в который поместить текст и кнопку
        </li>
        <li>Logo - это готовый логотип <b>Just Sell</b></li>
        <li>
          Текст - элемент текст, в который вы можете вводить любое содержимое
        </li>
        <li>Изменение языка - элемент переключатель языка</li>
        <li>
          Базовый экран - элемент, который содержит логотип Just Sell,
          переключатель языка. Можете использовать его чтобы создать базовый
          шаблон вашего экрана. Вы можете менять расположение переключателя
          языка, логотипа
        </li>
      </ul>

      <h2>Анимация</h2>

      <p>
        Элементы, которые отвечают за разного рода анимации. Содержит как
        готовые анимация, так возможность добавить свои
      </p>

      <h2>Формы</h2>

      <p>Элементы для создания форм</p>
      <ul>
        <li>
          Форма - корневой обязательный элемент для формы. Служат "ящиком" для
          ваших полей ввода
        </li>
        <li>
          Input - поле для ввода. По-умолчанию стилизирован, но вы можете менять
          стили под свои нужды
        </li>
        <li>Textarea - поле для ввода мультистрочного текста</li>
      </ul>

      <h1>Рабочая область</h1>

      <p>
        Основная часть экрана, с которой вы будете работать :) Это эмуляция
        экрана терминала, который поможет вам сделать собственный интерфейс. В
        эту область необходимо перетягивать элементы. По-умолчанию, содержит
        элемент "Базовый экран" Все элементы, которые попадают в Рабочую область
        можно удалять, менять местами, дублировать
      </p>

      <p>Спасибо за внимание. Если появятся вопросы - свяжитесь с нами :)</p>
    </div>
  </VModal>
</template>

<script setup lang="ts">
import VModal from "../../components/ui/modal/VModal.vue";
import { ref } from "vue";

const modal = ref<typeof VModal>();

const open = () => {
  modal.value?.open();
};
</script>

<style lang="scss">
.help-content {
  img {
    margin-bottom: 1rem;
  }

  h1 {
    font-size: 2rem;
    font-weight: 600;
    margin-bottom: 0.5rem;
  }

  h2 {
    font-size: 1.5rem;
    font-weight: 500;
    margin-bottom: 0.5rem;
  }

  p {
    margin-bottom: 1.5rem;
  }

  ol {
    margin-bottom: 1.5rem;
    margin-inline-start: 1rem;

    li {
      list-style: decimal;
    }
  }

  ul {
    margin-bottom: 1.5rem;
    margin-inline-start: 1rem;

    li {
      list-style: disc;
    }
  }
}
</style>
